package hometasks.zhernokleva.lesson7.a1;

public class Run {
    public static void main(String[] args) {
        University bstu = new University();
        System.out.println(bstu.kolya.toString());

    }
}
/*Создайте класс University, который содержит поле с типом Student.
Внутренний класс Student должен хранить информацию о студенте.
Создайте класс Run и в методе main выведите в консоль информацию о
студенте.*/