package hometasks.nesterovich7.a1;

public class Run {
    public static void main(String[] args) {
        University.Student kolya = new University.Student();
        System.out.println("Age is " + kolya.age);
        System.out.println("Years of studing is " + kolya.yearsOfStuding);

    }
}
/*Создайте класс University, который содержит поле с типом Student.
Внутренний класс Student должен хранить информацию о студенте.
Создайте класс Run и в методе main выведите в консоль информацию о
студенте.*/