package Lizun6;

import java.util.regex.Matcher;
import java.util.regex.Pattern;

public class B5 {
    public static void main(String[] args) {
        String versh = "Трэба дома бываць часцей,\n" +
                "Трэба дома бываць не госцем,\n" +
                "Каб душою не ачарсцвець,\n" +
                "Каб не страціць святое штосьці.\n" +
                " \n" +
                "Не забыць, як падвялы аер\n" +
                "На памытай падлозе пахне,\n" +
                "Як у студню цыбаты асвер\n" +
                "Запускае руку да пахі.\n" +
                " \n" +
                "Не забыць сцежкі той, што цябе\n" +
                "На дарогу выводзіла з дому,\n" +
                "Што ў хаце там быў рубель\n" +
                "У цане i па курсу старому.\n" +
                " \n" +
                "Не забыць, як марозам злым\n" +
                "Клямка пальцы пячэ балюча\n" +
                "I адкуль на стале тваім\n" +
                "Бохан свежага хлеба пахучы.\n" +
                " \n" +
                "Помніць свой на iржышчы цень,\n" +
                "Не забыць, як завуць суседа,\n" +
                "Не забыць, як пяе пад дзень\n" +
                "За вясёлым сталом бяседа.\n" +
                " \n" +
                "Трэба дома бываць часцей,\n" +
                "Трэба дома бываць не госцем,\n" +
                "Каб душою ты стаў чысцей\n" +
                "I не страціў святое штосьці.\n";

        Pattern newWord = Pattern.compile("\\b(?iu)[iуеаояию].*");
        String[] arrayVersh = versh.split("\\s");

        for (String s : arrayVersh) {
            Matcher mat = newWord.matcher(s);
            while (mat.find())
                System.out.println(mat.group());
        }
    }
}